* TPK PROGRAM IN COBOL FOR BURROUGHS MCP
IDENTIFICATION DIVISION.
    PROGRAM-ID. TPK
    AUTHOR.     RUPERT LANE AND GEMINI
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
    SOURCE-COMPUTER. B-5500.
    OBJECT-COMPUTER. B-5500.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT PRINT-FILE ASSIGN TO PRINTER.
DATA DIVISION.
FILE SECTION.
    FD PRINT-FILE;
        DATA RECORDS ARE PRT1.
    01 PRT1.
         05  PRT2         PIC X(120).
WORKING-STORAGE SECTION.
    01 NUMBER-TABLE.
        05 INPUT-NUMBER   PIC 99.
        05 NUMBER-X       PIC 99 OCCURS 11 TIMES.
    01 SUBSCRIPTS.
        05 NDX            PIC 99.
    01 CALCULATION-FIELDS.
        05 CURRENT-NUM    PIC 99.
        05 RESULT         PIC 9999999.
    01 DISPLAY-FIELDS.
        05 DISPLAY-RESULT PIC 999.
PROCEDURE DIVISION.
MAIN SECTION.
000-MAIN-LOGIC.
    DISPLAY "PLEASE ENTER 11 NUMBERS"
    PERFORM 100-ACCEPT-NUMBERS
        VARYING NDX FROM 1 BY 1
        UNTIL NDX GREATER THAN 11.
    DISPLAY "RESULTS ARE".
    PERFORM 200-PROCESS-NUMBERS
        VARYING NDX FROM 11 BY -1
        UNTIL NDX LESS THAN 1.
    STOP RUN.
100-ACCEPT-NUMBERS.
    ACCEPT INPUT-NUMBER.
    MOVE INPUT-NUMBER TO NUMBER-X(NDX).
200-PROCESS-NUMBERS.
    MOVE NUMBER-X(NDX) TO CURRENT-NUM.
    COMPUTE RESULT = SQRT(ABS(CURRENT-NUM))
        + (5 * (CURRENT-NUM ** 3)).
    IF RESULT GREATER THAN 400
        DISPLAY "TOO LARGE"
    ELSE
        MOVE RESULT TO DISPLAY-RESULT
        DISPLAY DISPLAY-RESULT
    END-IF.
END-OF-JOB.
